{"basics":{"name":"Sihang Wu","gender":"Male","birth":"14/03/2001","email":"wusihang999@gamil.com","phone":"","url":"","summary":""},"education":[{"institution":"Zhengzhou University","location":"Zhengzhou, China","url":"https://english.zzu.edu.cn/","area":"Electronic Information Engineering","studyType":"Bachelor","startDate":"2018-09-01","endDate":"2020-09-01","final-grade":"3.3/4.0"},{"institution":"University of Duisburg-Essen","location":"Duisburg, Germany","url":"https://www.uni-due.de/de/index.php","area":"Electrical and Electronic Engineering","studyType":"Bachelor","startDate":"2020-10-01","endDate":"2023-10-01","final-grade":"2.0/1.0"},{"institution":"Technical University of Munich","location":"Munich, Germany","url":"https://www.tum.de/","area":"Comuncation and Electronics Engineering","studyType":"Master","startDate":"2023-10-01","endDate":"current","current-grade":"1.8/1.0"}],"work":[{"companyName":"Dejet","position":"Test engineer","url":"http://www.dejet.de/index.html","startDate":"2022-03-08","endDate":"2023-06-09","summary":"","summaries":["Testing communication functions and power consumption for smartphones (OPPO, XIAOMI, VIVO, Realme), ensuring device performance and energy efficiency. ","Developed and executed test plans independently for both workplace and laboratory environments, adhering to quality and performance standards. ","Collaborated with local customers to conduct joint testing, providing valuable insights and ensuring client satisfaction."],"highlights":""},{"companyName":"Huawei","position":"Software developer","url":"https://developer.huawei.com/consumer/de/","startDate":"2023-02-01","endDate":"2023-08-01","summary":"","summaries":["Developed website using HTML, JavaScript, Bootstrap, and WordPress, helping colleage to download the apk file massly and automatically. ","Proficient in Python and SQLite, with the ability to skip the website's robot recognition, process the website's button and text interactions, record all download results and store apk files. ","Collaborated on projects using Git/Github and Docker, working closely with colleagues to develop, manage, and track project versions efficiently"],"highlights":""},{"companyName":"Sunlit Solar","position":"Student Technician in Testing and Repairs","url":"https://www.sunlitsolar.de/","startDate":"2024-08-01","endDate":"2024-12-01","summary":"","summaries":["Battery Testing and Monitoring: Conducted battery input/output analysis using oscilloscopes and multimeters, monitored charging/discharging behavior, and utilized adjustable power supplies for recharging.","Battery Assembly and Soldering: Performed soldering on ESP32 chips, disassembled and assembled batteries, and replaced battery components.","Cable Assembly and Connection: Ensured accurate cable-to-interface connections based on design diagrams and assembly instructions.","Battery Monitoring and Error Handling: Monitored battery performance, identified error codes, and implemented timely countermeasures."],"highlights":""}],"projects":[{"name":"Condition Monitoring of Vehicles","summary":"The project is my bachelor thesis in Duisburg-Essen Uni, I connected the STMicroelectronics ASM330LHHX microcontroller(intergrated with Gyroscope and accelerometer) and the Texas Instruments INA228 current/voltage sensor via the I2C interface. And the sensor data is used by the Machine Learning core(the decision tree) integrated in the ASM330LHHX to obtain the state of motion of the vehicle and the whole device's power consumption.","highlights":["ASM330lHHX","INA228"],"startDate":"2023-05-15","endDate":"2018-09-01","url":""},{"name":"The implementation of IDEA on an FPGA board","summary":"In this project/lab, I used VHDL to implement and simulate the International Data Encryption Algorithm (IDEA) by software Xilinx ISE independently. Then I tested the implementations on an FPGA board(Spartan-3E Starter Kit). In the end, I did two optimizations, the first optimization uses the control unit and registers to achieve only one round for eight times encryption process. For the second time, The use of FPGA resources is further reduced by slitting a round into 4 partial steps and reusing Adder, multipliers and XOR Modules.","highlights":["FPGA","IDEA","Xilinx ISE"],"startDate":"2024-04-01","endDate":"2024-08-01","url":""}],"languages":[{"language":"German","fluency":"Telc B2","icon":""},{"language":"English","fluency":"IELTS 6.5","icon":"IELTS 6.5"},{"language":"Chinese","fluency":"Native speaker","icon":""}]}